interface ModalDataType {
  [key: string]: string[][];
}

export const modalData: ModalDataType = {
  "항공권 예약": [
    ["항공권 예매", "단체 예매(국내선, 10명 이상)"],
    ["부산-김포 정기권"],
    [
      "이용 안내",
      "항공권예매안내",
      "전자항공권(여정안내서)",
      "항공권 환불",
      "항공권 재발행",
    ],
    ["항공운임 안내", "국내선", "국제선"],
    ["운항 정보", "스케쥴 조회", "취황노선", "실시간출도착", "항공기 소개"],
  ],
  마이페이지: [
    ["회원정보 수정"],
    ["나의 예약조회"],
    ["구매내역"],
    ["쿠폰내역", "쿠폰 안내", "항공권 쿠폰", "부가서비스 쿠폰"],
    ["스탬프 조회", "전체조회", "상세조회"],
    ["제휴사 예약 조회", "호텔", "렌터카", "여행자보험", "포켓와이파이"],
  ],
  "서비스 안내": [
    [
      "스탬프",
      "FLY&STAMP 안내",
      "STAMP 구매/환불",
      "STAMP 양도",
      "누락 STAMP 적립",
    ],
    [
      "도움이 필요한 손님",
      "임산부/유아동반 손님",
      "반려동물 동반 손님",
      "휠체어 서비스 필요 손님",
      "투게더 서비스",
      "혼자 여행하는 어린이",
      "의사소견서 필요 손님",
    ],
    [
      "공항 서비스",
      "탑승수속",
      "연결탑승수속",
      "탑승권 자동발급",
      "홈페이지/모바일 탑승권",
      "취항지 공항/카운터 정보",
      "출입국 신고서",
      "라운지 안내",
    ],
    [
      "수화물",
      "무료 수화물",
      "유료 수화물",
      "특수 수화물",
      "포장용품 안내",
      "운송제한 물품",
      "수화물 배상",
      "유실물 안내",
    ],
    ["기내 서비스", "기내 서비스", "기내 면세품", "AIRBUSAN MALL"],
    ["부가서비스 구매", "번들", "수화물", "좌석", "라운지", "기내식"],
    ["하늘 책방(e-book 서비스)"],
  ],
  이벤트: [["진행중인 이벤트"], ["당첨자 발표"]],
  "로고샵/제휴상품": [
    ["SHOP AIR BUSAN"],
    ["FLY & FUN", "국내", "해외"],
    [
      "여행상품",
      "호텔",
      "입장권/투어",
      "렌터카",
      " 여행자보험",
      "포켓와이파이/유심/eSIM",
    ],
    ["제휴카드", "신한"],
  ],
};
